# DataFrame Reshape

In [1]:
import pandas as pd

In [2]:
dictdf= {"EmpName":["Jacob","Marcos","Dane"],
     "EmpID":[111,222,333],
     "EmpTitle":["Banker","Team Manager","Analyst"]}
df=pd.DataFrame(dictdf)

In [3]:
df

  EmpName  EmpID      EmpTitle
0   Jacob    111        Banker
1  Marcos    222  Team Manager
2    Dane    333       Analyst

In [15]:
df_melted=pd.melt(df,id_vars=["EmpID"],value_vars=["EmpName","EmpTitle"], var_name="Attribute", value_name="Value")

In [16]:
df_melted

   EmpID Attribute         Value
0    111   EmpName         Jacob
1    222   EmpName        Marcos
2    333   EmpName          Dane
3    111  EmpTitle        Banker
4    222  EmpTitle  Team Manager
5    333  EmpTitle       Analyst

In [17]:
df_Unmelted=df_melted.pivot(index='EmpID',columns='Attribute')
df_Unmelted

            Value
Attribute EmpName      EmpTitle
EmpID
111         Jacob        Banker
222        Marcos  Team Manager
333          Dane       Analyst

In [18]:
df

  EmpName  EmpID      EmpTitle
0   Jacob    111        Banker
1  Marcos    222  Team Manager
2    Dane    333       Analyst

In [20]:
df_Unmelted=df_Unmelted['Value'].reset_index()
df_Unmelted

Attribute  EmpID EmpName      EmpTitle
0            111   Jacob        Banker
1            222  Marcos  Team Manager
2            333    Dane       Analyst

In [21]:
df_Unmelted.columns.name=None
df_Unmelted

   EmpID EmpName      EmpTitle
0    111   Jacob        Banker
1    222  Marcos  Team Manager
2    333    Dane       Analyst

In [22]:
df

  EmpName  EmpID      EmpTitle
0   Jacob    111        Banker
1  Marcos    222  Team Manager
2    Dane    333       Analyst

# Stack

In [23]:
df_stack=df.stack()
df_stack

0  EmpName            Jacob
   EmpID                111
   EmpTitle          Banker
1  EmpName           Marcos
   EmpID                222
   EmpTitle    Team Manager
2  EmpName             Dane
   EmpID                333
   EmpTitle         Analyst
dtype: object

# Unstack

In [24]:
df_unstack=df_stack.unstack()

In [25]:
df_unstack

  EmpName EmpID      EmpTitle
0   Jacob   111        Banker
1  Marcos   222  Team Manager
2    Dane   333       Analyst

In [26]:
df

  EmpName  EmpID      EmpTitle
0   Jacob    111        Banker
1  Marcos    222  Team Manager
2    Dane    333       Analyst